app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "gmamuns@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-01-09 13:54:05.896800"], ["updated_at", "2023-01-09 13:54:05.896800"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])